Revit 2027 API
BaseImportOptions.ColorMode Property
 Color mode for the import. Three modes are supported. Black and White, Preserve Colors, and Invert Colors.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ImportColorMode ColorMode { get; set; }
Public Property ColorMode As ImportColorMode
	Get
	Set
public:
property ImportColorMode ColorMode {
	ImportColorMode get ();
	void set (ImportColorMode value);
}
member ColorMode : ImportColorMode with get, set
Property Value
ImportColorMode
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
BaseImportOptions Class
Autodesk.Revit.DB Namespace